OpenFOAM/StandingSchock/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1712                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          400;
        startFace       319200;
    }
    outlet
    {
        type            patch;
        nFaces          400;
        startFace       319600;
    }
    left
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          400;
        startFace       320000;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  right;
    }
    right
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          400;
        startFace       320400;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  left;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          320000;
        startFace       320800;
    }
)

// ************************************************************************* //
